04_OpenFoam/_ref/OpenFOAM-14/multiphaseEuler/bed/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource
{
    type            massSource;

    phase           water;

    cellZone
    {
        type            containsPoints;
        points          ((0.075 0.925 0.05));
    }

    massFlowRate
    {
        type            square;
        amplitude       0.5;
        frequency       0.5;
        level           0.5;
        markSpace       0.3333;
    }
}

// ************************************************************************* //
